## 결측치 데이타 처리

- 결측치는 데이터 분석 결과에 엄청난 영향을 미치기에 존재여부 확인부터 중요

- None를 포함하며, 결측값은 ‘NaN’로 표시


- 결측값 확인 메소드 
    * isnull()
    * notnull()
    
    
- 결측값 처리 	
    (1) 제거 : dropna()      	
    (2) 대치 : fillna()

In [2]:
import pandas as pd
import numpy as np 

df = pd.DataFrame(np.ones((4,4)),index=['A','B','C','D'])
df

     0    1    2    3
A  1.0  1.0  1.0  1.0
B  1.0  1.0  1.0  1.0
C  1.0  1.0  1.0  1.0
D  1.0  1.0  1.0  1.0

In [3]:
# 결측치 만들기 ( NaN, nan)
#일부러 결측치 생성
df.iloc[1][1] = np.NaN #[1]
df.loc['B'][2]=np.nan #[2]

df.iloc[1:,2] = np.NaN #[3]
#원래 없던 값들에 결측치들을 생성

In [4]:
df

     0    1    2    3
A  1.0  1.0  1.0  1.0
B  1.0  NaN  NaN  1.0
C  1.0  1.0  NaN  1.0
D  1.0  1.0  NaN  1.0

In [5]:
# 누적합을 구할 때
df.cumsum()

     0    1    2    3
A  1.0  1.0  1.0  1.0
B  2.0  NaN  NaN  2.0
C  3.0  2.0  NaN  3.0
D  4.0  3.0  NaN  4.0

In [9]:
print(df.isnull())
print("-"*50)
print(df.isnull().count())
print(df.isnull().sum())
#열 단위로 트루일때 1의 값을 가지기 떄문에 다음과 같이 값이 나온다.

       0      1      2      3
A  False  False  False  False
B  False   True   True  False
C  False  False   True  False
D  False  False   True  False
--------------------------------------------------
0    4
1    4
2    4
3    4
dtype: int64
0    0
1    1
2    3
3    0
dtype: int64

우선 없는 값에 대해서 처리를 해주는 함수는 isnull()이 해주지만  
  
있는 값에 대해서는 False로 처리를 해주고 없는 값이 발견이 되면  
  
True로 처리를 해준다. 하지만 출력을 할때 데이터가 True와 false  
  
로는 데이터를 활용을 할 수 없기 떄문에 count를 사용을 했지만  
  
count는 컬럼이 있는 것만 갯수를 세기 때문에  
  
sum()함수를 활용을 해서 열마다 없는 값이 True로 대체되어 있는 값들을  
  
합계를 출력을 하는 방식으로 한다 행(가로로 하는 방법은 잘 모름;;)

In [17]:
df.dropna()

     0    1    2    3
A  1.0  1.0  1.0  1.0

해당하는 값들을 줄 전체로 없애기 때문에  
많은 데이터들이 같이 사라진다.
True가 없는 값인것을 dropna함수를 이용해서  
없애는게 가능 하지만 그 해당하는 행(가로)자체가  
사라지기 때문에  
좋은 방법은 아니다.

In [18]:
df.fillna(0)

     0    1    2    3
A  1.0  1.0  1.0  1.0
B  1.0  0.0  0.0  1.0
C  1.0  1.0  0.0  1.0
D  1.0  1.0  0.0  1.0

결측치 NaN의 값을 0으로 대체하게 바꿔준다.  
하지만 이것을 0말고도 다른 값으로도 대체할떄도 있다.

In [19]:
df.fillna("Unknow")

     0       1       2    3
A  1.0     1.0     1.0  1.0
B  1.0  Unknow  Unknow  1.0
C  1.0     1.0  Unknow  1.0
D  1.0     1.0  Unknow  1.0

In [20]:
df.fillna({1:"Unknow",2:-100})

     0       1      2    3
A  1.0     1.0    1.0  1.0
B  1.0  Unknow -100.0  1.0
C  1.0     1.0 -100.0  1.0
D  1.0     1.0 -100.0  1.0

이렇게 키 벨류 값으로 각각의 대체할 값들을 지정 할 수 도 있다.  
보통 평균값들로 대체해달라고 하는 곳이 많다.